export const posts = [
    {
        id: 1,
        title: "Начало работы с React Native",
        description: "React Native позволяет разрабатывать приложения для iOS и Android, используя знакомый React. Разберем основные концепции и отличия от веб-разработки.",
        category: "Мобильная разработка",
        createdAt: "2023-10-01",
        imageUrl: "6173700c-b150-4d2d-94a7-a69aeea152eb",
        author: "User_9b25a",
        likes: 12,
        comments: 5,
        text: "React Native — это мощный инструмент для разработки мобильных приложений, который позволяет использовать JavaScript и React для создания нативных приложений для iOS и Android. Он предоставляет разработчикам возможность писать код один раз и запускать его на обеих платформах, что значительно экономит время и ресурсы. В этом посте мы рассмотрим основные преимущества React Native, такие как высокая производительность, доступ к нативным API и возможность использования сторонних библиотек. Также обсудим, как React Native отличается от традиционной веб-разработки и какие инструменты могут помочь в разработке приложений."
    },
    {
        id: 2,
        title: "Разбираемся в технологии ChatGPT",
        description: "ChatGPT и другие крупные языковые модели произвели революцию в NLP. Рассмотрим, как работает технология и каковы её применения.",
        category: "Искусственный интеллект",
        createdAt: "2023-10-02",
        imageUrl: "6173700c-b150-4d2d-94a7-a69aeea152eb",
        author: "User_9b25a",
        likes: 25,
        comments: 10,
        text: "ChatGPT — это одна из самых передовых языковых моделей, разработанная OpenAI. Она использует глубокое обучение для генерации текста, который выглядит так, как будто его написал человек. Эта технология находит применение в различных областях, включая создание контента, автоматизацию обслуживания клиентов и даже в образовании. В этом посте мы подробно рассмотрим, как работает ChatGPT, его архитектуру и алгоритмы, а также обсудим его преимущества и недостатки. Мы также рассмотрим примеры использования ChatGPT в реальных приложениях и его влияние на будущее технологий."
    },
    {
        id: 3,
        title: "Продвинутый TypeScript",
        description: "TypeScript добавляет статическую типизацию в JavaScript, что помогает обнаруживать ошибки на этапе компиляции. Узнайте как эффективно использовать TypeScript.",
        category: "Веб-разработка",
        createdAt: "2023-10-03",
        imageUrl: "6173700c-b150-4d2d-94a7-a69aeea152eb",
        author: "User_9b25a",
        likes: 18,
        comments: 7,
        text: "TypeScript — это надстройка над JavaScript, которая добавляет статическую типизацию и другие полезные функции. Это позволяет разработчикам находить ошибки на этапе компиляции, что значительно упрощает процесс разработки и улучшает качество кода. В этом посте мы обсудим основные преимущества использования TypeScript, такие как улучшенная поддержка IDE, возможность использования интерфейсов и типов, а также совместимость с существующим JavaScript-кодом. Мы также рассмотрим, как TypeScript может помочь в разработке крупных приложений и как его интегрировать в существующие проекты."
    }
];
